tutorials/compressible/steadyCompressibleFoam/2bump/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (572 0 0);

boundaryField
{
    INLE1
    {
        type            fixedValue;
        value           uniform (572 0 0);
    }

    OUTL2
    {
        type           inletOutlet;
        inletValue     uniform (0 0 0);

//         type            waveTransmissive;
//         phi             phi;
//         rho             rho;
//         psi             psi;
//         U               U;
//         gamma           1.4;
//         inletOutlet     true;
//         correctSupercritical true;
//         lInf            0;
//         fieldInf        (0 0 0);

        value          $internalField;
    }

    WALL3
    {
        type            symmetryPlane;
    }

    WALL4
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    SYMP5
    {
        type            empty;
    }
}


// ************************************************************************* //
